In [3]:
import pandas as pd
sr=pd.Series([10,20,30,40,50])
print((sr))

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
import numpy as np
data=np.array([10,20,30,40])
data

array([10, 20, 30, 40])

In [5]:
import numpy as np
data=np.array([10,20,30,40])
data
s=pd.Series(data)
s

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
data=np.array([10,20,30,40])
data
s=pd.Series(data,index=[100,101,102,104])
s

100    10
101    20
102    30
104    40
dtype: int64

In [7]:
#dict to series

In [8]:
data1={'a':0,'b':1,'c':2}

In [11]:
s1=pd.Series(data1,index=['a','b','c','d'])

In [12]:
s1

a    0.0
b    1.0
c    2.0
d    NaN
dtype: float64

In [16]:
df=pd.DataFrame({'Name':['test','demo','admin','jhon','manager'],
                'age':[10,20,30,50,60]},index=[1,2,3,4,5])
df

      Name  age
1     test   10
2     demo   20
3    admin   30
4     jhon   50
5  manager   60

In [45]:
#for nan values we can use numpy eg:np.man
import numpy as np
dt={'Name':[np.nan,'james','ricky','messi'],
   'age':pd.Series([26,np.nan,23,27]),
    'rateing':pd.Series([4,23,3,29])}
dt
a=pd.DataFrame(dt)
a

    Name   age  rateing
0    NaN  26.0        4
1  james   NaN       23
2  ricky  23.0        3
3  messi  27.0       29

In [27]:
a.T

            0      1      2      3
Name      NaN  james  ricky  messi
age      26.0    NaN   23.0   27.0
rateing     4     23      3     29

In [28]:
df.isnull()

    Name    age
1  False  False
2  False  False
3  False  False
4  False  False
5  False  False

In [29]:
df.dtypes

Name    object
age      int64
dtype: object

In [55]:
a.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['Name', 'age', 'rateing'], dtype='object')]

In [56]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   age      3 non-null      float64
 2   rateing  4 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

In [57]:
a.notnull()

    Name    age  rateing
0  False   True     True
1   True  False     True
2   True   True     True
3   True   True     True

In [37]:
a='python'
print('o'is not a)

True

<>:2: SyntaxWarning: "is not" with a literal. Did you mean "!="?
<>:2: SyntaxWarning: "is not" with a literal. Did you mean "!="?
/tmp/ipykernel_5779/3162335959.py:2: SyntaxWarning: "is not" with a literal. Did you mean "!="?
  print('o'is not a)

In [38]:
a='python'
print('o'is a)

False

<>:2: SyntaxWarning: "is" with a literal. Did you mean "=="?
<>:2: SyntaxWarning: "is" with a literal. Did you mean "=="?
/tmp/ipykernel_5779/3810251495.py:2: SyntaxWarning: "is" with a literal. Did you mean "=="?
  print('o'is a)

In [41]:
a=10
b=10
print(a is b)

True

In [42]:
a=[10,20]
b=[10,20]
print(a is b)

False

In [44]:
['age'].dtypes

NameError: name 'n' is not defined

In [46]:
dt['age'].dtypes

dtype('float64')

In [47]:
dt['age','Name']

KeyError: ('age', 'Name')

In [48]:
dt['Name','age']

KeyError: ('Name', 'age')

In [49]:
df1[['age','name']]

NameError: name 'df1' is not defined

In [51]:
df[['age,'Name']]

SyntaxError: invalid syntax (2326478711.py, line 1)

In [52]:
dt[['age','Name']]

TypeError: unhashable type: 'list'

In [53]:
df2[['age','Name']]

NameError: name 'df2' is not defined

In [54]:
df[['age','Name']]

   age     Name
1   10     test
2   20     demo
3   30    admin
4   50     jhon
5   60  manager

In [73]:
dt1={'Name':pd.Series(['tom','james','ricky','messi','steve','smith']),
    'age':pd.Series([25,26,25,23,30,29]),
    "rateing":pd.Series([4.23,3.24,3.98,2.56,3.20,4.6])}
dt1
df1=pd.DataFrame(dt1)
df1

    Name  age  rateing
0    tom   25     4.23
1  james   26     3.24
2  ricky   25     3.98
3  messi   23     2.56
4  steve   30     3.20
5  smith   29     4.60

In [74]:
df1.sum()

Name       tomjamesrickymessistevesmith
age                                 158
rateing                           21.81
dtype: object

In [76]:
df1.describe()

             age   rateing
count   6.000000  6.000000
mean   26.333333  3.635000
std     2.658320  0.762253
min    23.000000  2.560000
25%    25.000000  3.210000
50%    25.500000  3.610000
75%    28.250000  4.167500
max    30.000000  4.600000

In [77]:
df1.describe(include=['float64'])

        rateing
count  6.000000
mean   3.635000
std    0.762253
min    2.560000
25%    3.210000
50%    3.610000
75%    4.167500
max    4.600000

In [78]:
df1.describe(include=['int64'])

             age
count   6.000000
mean   26.333333
std     2.658320
min    23.000000
25%    25.000000
50%    25.500000
75%    28.250000
max    30.000000